# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [162]:
import pandas as pd
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
df_1 = pd.read_csv(url)
df_1.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [163]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
df_2 = pd.read_csv(url)
df_2.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [164]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'
df_3 = pd.read_csv(url)
df_3.head(3)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car

In [165]:
df_1.columns = df_1.columns.str.lower().str.replace(' ', '_')
df_2.columns = df_2.columns.str.lower().str.replace(' ', '_')
df_3.columns = df_3.columns.str.lower().str.replace(' ', '_')

changes = {'st': 'state'}
df_1 = df_1.rename(columns = changes)
df_2 = df_2.rename(columns = changes)

In [166]:
cols = df_1.columns
df_2 = df_2[cols]
df_3 = df_3[cols]

In [167]:
df_1['gender'] = df_1['gender'].replace(['female', 'Femal'], 'F')
df_1['gender'] = df_1['gender'].replace('Male', 'M')

df_2['gender'] = df_2['gender'].replace('female', 'F')
df_2['gender'] = df_2['gender'].replace('Male', 'M')

In [168]:
change_state = {'Cali': 'California', 'WA': 'Washington', 'AZ': 'Arizona'}
df_1['state'] = df_1['state'].replace(change_state)
df_2['state'] = df_2['state'].replace(change_state)
df_2['state'] = df_2['state'].replace(change_state)

In [169]:
change_education = {'Bachelors': 'Bachelor'}
df_1['education'] = df_1['education'].replace(change_education)
df_2['education'] = df_2['education'].replace(change_education)

In [170]:
df_1['customer_lifetime_value'] = df_1['customer_lifetime_value'].str.rstrip('%')
df_2['customer_lifetime_value'] = df_2['customer_lifetime_value'].str.rstrip('%')

In [171]:
df_1['vehicle_class'] = df_1['vehicle_class'].replace(['Luxury SUV', 'Luxury Car', 'Sports Car'], 'Luxury')
df_2['vehicle_class'] = df_2['vehicle_class'].replace(['Luxury SUV', 'Luxury Car', 'Sports Car'], 'Luxury')
df_3['vehicle_class'] = df_3['vehicle_class'].replace(['Luxury SUV', 'Luxury Car', 'Sports Car'], 'Luxury')

In [172]:
df_1['number_of_open_complaints'] = df_1['number_of_open_complaints'].str.lstrip('1').str.rstrip('0').str.strip('/')
df_2['number_of_open_complaints'] = df_2['number_of_open_complaints'].str.lstrip('1').str.rstrip('0').str.strip('/')

In [173]:
df_1 = df_1.dropna(subset=['customer'])

In [178]:
df_1['customer_lifetime_value'] = df_1['customer_lifetime_value'].apply(float)
df_2['customer_lifetime_value'] = df_2['customer_lifetime_value'].apply(float)
df_1['numer_of_open_complaints'] = df_1['number_of_open_complaints'].apply(int)
df_2['numer_of_open_complaints'] = df_2['number_of_open_complaints'].apply(int)

In [180]:
df_1['customer_lifetime_value'].fillna(df_1['customer_lifetime_value'].mean(), inplace=True)
df_2['customer_lifetime_value'].fillna(df_2['customer_lifetime_value'].mean(), inplace=True)

C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\1737707520.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_1['customer_lifetime_value'].fillna(df_1['customer_lifetime_value'].mean(), inplace=True)
C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\1737707520.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_2['customer_lifetime_value'].fillna(df_2['customer_lifetime_value'].mean(), inplace=True)

In [181]:
df_1['gender'].fillna(method='bfill', inplace=True)
df_2['gender'].fillna(method='bfill', inplace=True)

C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\3059143110.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_1['gender'].fillna(method='bfill', inplace=True)
C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\3059143110.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_1['gender'].fillna(method='bfill', inplace=True)
C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\3059143110.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_2['gender'].fillna(method='bfill', inplace=True)
C:\Users\Lidia Mayor\AppData\Local\Temp\ipykernel_17312\3059143110.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_2['gender'].fillna(method='bfill', inplace=True)

In [191]:
df = pd.concat([df_1, df_2, df_3])

In [199]:
df.shape

(9137, 12)

In [200]:
df.drop_duplicates(inplace=True)

In [201]:
df.shape

(9134, 12)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [23]:
import pandas as pd
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv'
df_company = pd.read_csv(url)
df_company.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [24]:
df_company.drop(columns=['unnamed:_0'], inplace=True)

In [25]:
df_company.drop_duplicates(inplace=True)

In [26]:
df_claim = df_company.pivot_table(index='sales_channel', values=['total_claim_amount'], aggfunc='sum').round(2)
df_claim

               total_claim_amount
sales_channel
Agent                  1748923.49
Branch                 1259333.44
Call Center             889094.77
Web                     676658.10

In [27]:
df_lifetime = df_company.pivot_table(index=['gender','education'], values='customer_lifetime_value', aggfunc='mean').round(2)
df_lifetime

                             customer_lifetime_value
gender education
F      Bachelor                              7913.45
       College                               7755.03
       Doctor                                7369.59
       High School or Below                  8616.66
       Master                                8226.36
M      Bachelor                              7713.30
       College                               8086.29
       Doctor                                7414.86
       High School or Below                  8162.36
       Master                                8154.61

In [28]:
df_lifetime = df_company.pivot_table(index='gender',columns='education', values='customer_lifetime_value', aggfunc='mean').round(2)
df_lifetime

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7913.45  7755.03  7369.59               8616.66  8226.36
M           7713.30  8086.29  7414.86               8162.36  8154.61

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [204]:
# Your code goes here